#!/usr/bin/env python
# -*- coding:utf-8 -*-
# author: yaoxing
# datetime: 2024/1/25 12:03

agent_type_dic = {0: "试玩", 1: "测试", 2: "正式", 3: "商务", 4: "置换"}
agent_type_dic_reverse = {"试玩": 0, "测试": 1, "正式": 2, "商务": 3, "置换": 4}
adjust_way_dic = {"加额": 1, "减额": 2}
in_adjust_type_dic = {"其它调整": 0, "会员活动": 1, "会员返水": 2, "会员存款(后台)": 3, "代客充值": 4, "会员VIP福利": 5}
out_adjust_type_dic = {"会员活动": 1, "会员返水": 2, "其它调整": 3, "会员提款(后台)": 4, "会员VIP福利": 5}
activity_type_dic = {"首存活动": 1, "充值送活动": 2, "VIP晋级优惠": 3}
order_status_dic = {0: "未结算", 1: "已结算", 2: "已取消", 4: "重新结算", 3: "跳局", 17: "投降", 5: "待开奖", 6: "已中奖",
                    7: "未中奖", 8: "挂起", 20: "撤销", 21: "和局", 9: "待结算", 10: "撤销", 11: "待处理", 12: "手动取消",
                    13: "待确认", 14: "风控拒单", 15: "赛事取消", 16: "已确认"}
classify_dic = {0: "未结算", 1: "已结算", 2: "已取消", 3: "重结算"}

# 注单数据查询归属维度
order_time_type = {"投注时间": 'betTime', "结算时间": 'firstSettleTime'}
