#!/usr/bin/env python
# -*- coding:utf-8 -*-
# author: yaoxing
# datetime: 2024/6/7 11:09

from enum import Enum


# 沙巴体育
class SbSportEnum(Enum):
    # 支持的类型
    sport_dic_t_zh = {"1": "足球", "2": "篮球", "3": "美式足球", "4": "冰上曲棍球", "5": "网球", "6": "排球", "7": "斯诺克",
                      "8": "棒球", "9": "羽毛球", "43": "电子竞技"}
    sport_dic_f_zh = {value: key for key, value in sport_dic_t_zh.items()}
    # market 投注选项
    key_dic_t_zh = {}
    # 篮球主盘口
    main_markets_dic = {"篮球": {"独赢": '20', "大小盘": '3', "让分": '1', "主队大小盘": '401', "客队大小盘": '402',
                               '单双': '2'},
                        "足球": {"独赢": '5', "让球": '1', "大小": '3', "半场独赢": ['15', '177'],
                               "半场让球": ['7', '17'], '半场大小': ['8', '18']},
                        "冰上曲棍球": {"独赢": '20', "让球": '1', "单双": '2', "大小": '3'},
                        "美式足球": {"独赢": '20', "让球": '1', "单双": '2', "大小": '3'},
                        "排球": {"独赢": '20', "让分": '704', "大小": '705', "球队大小": ('401', '402')},
                        "电子竞技": {"独赢": '20', "让球": '1', "单双": '2', "大小": '3'},
                        "棒球": {"独赢": '20', "局数获胜": '153', "大小": '3', "让球": '1', '单双': '2'},
                        "羽毛球": {"独赢": '20', '全场让局': '701', "让分": '704', '全场总分': '705'},
                        "斯诺克": {"独赢": '20', "让局": '1', "总局数": '3'},
                        "网球": {"独赢": '20', "让局": '153', '局数': '1306', '让盘': '1303'}
                        }
    # 大小盘口
    dx_market_list = [3, 8, 18, 156, 178, 197, 198, 204, 205, 220, 386, 387, 388, 389, 401, 402, 403, 404, 461, 462,
                      463, 464, 482, 483, 485, 610, 615, 616, 638, 639, 641, 705, 709, 1306, 1312, 3902, 3905, 3907,
                      3908, 9009, 9013, 9019, 9025, 9029, 9035, 9041, 9047, 9053, 9058, 9060, 9070]
    # 让球盘口
    handicap_market_list = [1, 7, 17, 219, 609, 637, 701, 704, 708, 153, 155, 1303, 1308, 1316, 3904, 9002, 9008,
                            9012, 9018, 9024, 9028, 9034, 9040, 9046, 9052, 9059, 9076, 9077, 9091, 9093, 9116,
                            28, 124, 125, 453, 477, 478]
    # 特殊让球盘口， 补加号时需不处理和局
    special_handicap_market_list = [28, 124, 125, 453, 477, 478]
